Repository: ThoSe1990/SphinxExample
Catalog: docs/locales/*/LC_MESSAGES/chapter2.po
Languages: de

source: Chapter 2: Including JavaScript
de: Kapitel 2: Einfügen von JavaScript

source: Lets's use chapter to add some JavaScript code here:
de: Nutzen wir dieses Kapitel um JavaScript-Code hinzuzufügen

source: With ``.. code-block:: js`` we can add JavaScript snippets:
de: Mit ``.. code-block:: js`` können wir JavaScirpt snippets einfügen

source: Source Code Documentation
de: Source Code Dokumentation

source: Foo is super important for this sphinx project
de: Foo ist eine wichtiger Teil für dieses Projekt

source: Create a Foo instance.
de: Erzeugt eine Foo Instanz

source: Arguments
de: Argumente

source: The initial value for member.
de: Der initiale Wert von member

source: Perform some work using the private member.
de: Erledigt etwas arbeit und nutzt den privaten Member

source: this parameter is mandatory.
de: Dieser Parameter ist obligatorisch

source: **number** -- The work results
de: **number** -- Ergebnisse
